app/Http/Controllers/Admin/LessonController.php

select count(*) as aggregate from `qz_lesson` where `qz_lesson`.`deleted_at` is null
---
    public function index(Request $request)
    {
        if($request->isMethod('post')) {

            //① 负责帮组datatable获得数据
            //获得纪录总条数
            $cnt = Lesson::count();