app/Http/Controllers/Admin/LivecourseController.php

    public function index(Request $request){

        $info = Livecourse::with('stream')->get();
---
select * from `qz_live_course` where `qz_live_course`.`deleted_at` is null