app/Http/Controllers/Admin/ManagerController.php

    public function showlist(){
        //Manager::get() 获取全部的数据表信息
        //Manager::fitst() 获取一条数据
        //Manager::fitst()


        /**
         * 调用get方法获得manager数据表中的全部信息
         * get()方法会返回一个collection集合对象,对象里面有成员,每个
         * 成员是一个独立的记录信息 这个成员的类型是manager对象
         * 这个collection 可以进行遍历,会把每一条数据遍历处理
         *
         */
        $info = Manager::get();
---
select * from `qz_manager` where `qz_manager`.`deleted_at` is null