app/Http/Controllers/Admin/StreamController.php

select * from `qz_stream` where `qz_stream`.`deleted_at` is null
---
    public function index(Request $request){
        //获取直播流列表信息
        $info = Stream::get();

insert into `qz_stream` (`stream_name`, `updated_at`, `created_at`) values ('xueyou06', '2017-06-29 14:18:46', '2017-06-29 14:18:46')
---

                //存储流信息到数据库
                   if($code == 200){
                       Stream::create($request->all());